WebServices/spring-ws/src/main/resources/sample/soap.xml

<soapenv:Envelope xmlns:sch="http://matson.com/gates/schemas" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header>
        <wsse:Security soapenv:mustUnderstand="1"
                       xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
            <wsu:Timestamp wsu:Id="Timestamp-7"
                           xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsu:Created>2013-06-10T01:34:15Z</wsu:Created>
                <wsu:Expires>2013-06-10T02:07:35Z</wsu:Expires>
            </wsu:Timestamp>
            <wsse:UsernameToken wsu:Id="UsernameToken-6"
                                xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd">
                <wsse:Username>stars</wsse:Username>
                <wsse:Password
                        Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">
                    jnt996gltd
                </wsse:Password>
                <wsse:Nonce
                        EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
                    0U3M1wCGZgi4JzCOWxrvsA==
                </wsse:Nonce>
                <wsu:Created>2013-06-10T01:34:15.815Z</wsu:Created>
            </wsse:UsernameToken>
        </wsse:Security>
    </soapenv:Header>
    <soapenv:Body>
        <sch:BookingRequest>
            <!--You may enter the following 2 items in any order-->
            <sch:shipmentNumber>1234567</sch:shipmentNumber>
            <sch:partyType>S</sch:partyType>
        </sch:BookingRequest>
    </soapenv:Body>
</soapenv:Envelope>